#include <iostream>

using namespace std;
int main() {
	setlocale(LC_ALL, "ru");
	long long K;
	cin >> K;
	if (K == 0) {
		cout << "Мы нашли " << K << " грибов в лесу" << '\n';
		return 0;
	}

	if (K == 1) {
		cout << "Мы нашли 1 гриб в лесу" << '\n';
		return 0;
	}

	if (K >= 2 && K <= 4)
		cout << "Мы нашли " << K << " гриба в лесу" << '\n';

	if (K >= 5 && K <= 20) {
		cout << "Мы нашли " << K << " грибов в лесу" << '\n';
		return 0;
	}

	if (K % 10 >= 2 && K % 10 <= 4)
		cout << "Мы нашли " << K << " гриба в лесу" << '\n';

	if (K % 10 >= 5 && K % 10 <= 9)
		cout << "Мы нашли " << K << " грибов в лесу" << '\n';

	if (K % 10 == 0)
		cout << "Мы нашли " << K << " грибов в лесу" << '\n';

	if (K % 100 == 11)
		cout << "Мы нашли " << K << " грибов в лесу" << '\n';

	if (K % 10 == 1 && K % 100 != 11)
		cout << "Мы нашли " << K << " гриб в лесу" << '\n';


	return 0;
}